LTC0213/STM32_CERS/CERS0201/Src/main.c
              }
              else
              {
                Test_Step++;
                timecount = 0;
                Force_Process_Step = 4;
                in0 = in1 = in2 = in3 = 0;
                HMI_value_setting("force1.inx.val",0);
                HMI_value_setting("force1.ad0.val",1);
                HMI_value_setting("force1.chx.val",Test_Step);
                printf("测试 %d 结束\n",Test_Step);
                switch(Test_Step)
                {
                  case 1: 
                    HMI_value_setting("force1.max1.val",maximum);//0.1N
                    maximum_record1=maximum;
                    maximum =0;
                  break;
                  case 2:
                    HMI_value_setting("force1.max2.val",maximum);
                    maximum_record2=maximum;
                    maximum =0;
                  break;
                  case 3:
                    HMI_value_setting("force1.max3.val",maximum);
                    maximum_record3=maximum;
                    maximum =0;
                    average = (maximum_record1+maximum_record2+maximum_record3)/3;
                    printf("average=%d N\n",average); //0.1N
                    
                    
                    standard_deviation=sqrt((pow(maximum_record1-average,2)+pow(maximum_record2-average,2)+pow(maximum_record3-average,2))/3);
                    // printf("standard_deviation=%d N\n",standard_deviation);
                    coefficient_variation = standard_deviation*100/average;
                    printf("coefficient_variation=%d \n",coefficient_variation);

                  break;
                }
                HAL_Delay(5000);
              }
            break;
            case 6:  
              if(Pain_stamp==1)
              {
                switch(force_modelx)
                {
                  case 1://前屈
                    HMI_value_setting("report5.x0.val",average);//平均值
                    HMI_value_setting("report5.x1.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report5.x2.val",average*100/113);//正常值比
                    HMI_value_setting("report5.x3.val",Pain_value*10);//疼痛值
                    if(average<3000)//300
                    {
                      HMI_value_setting("report5.j1.val",average/30);
                    }
                    else
                    {
                      HMI_value_setting("report5.j1.val",100);
                    } 
                    if(Pain_value>0)
                    {
                      HMI_value_setting("report0.va0.val",1);
                    }
                  break;
                  case 2://后伸
                    HMI_value_setting("report5.x5.val",average);//平均值
                    HMI_value_setting("report5.x6.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report5.x7.val",average*100/158);//正常值比
                    HMI_value_setting("report5.x8.val",Pain_value*10);//疼痛值
                    if(average<3000)//300
                    {
                      HMI_value_setting("report5.j0.val",average/30);
                    }
                    else
                    {
                      HMI_value_setting("report5.j0.val",100);
                    } 
                    if(Pain_value>0)
                    {
                      HMI_value_setting("report0.va1.val",1);
                    }
                  break;
                  case 3://左侧屈
                    HMI_value_setting("report4.x0.val",average);//平均值
                    HMI_value_setting("report4.x1.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report4.x2.val",average*100/113);//正常值比
                    HMI_value_setting("report4.x3.val",Pain_value*10);//疼痛值
                    if(average<2000)//200
                    {
                      HMI_value_setting("report4.j1.val",average/20);
                    }
                    else
                    {
                      HMI_value_setting("report4.j1.val",100);
                    } 
                    if(Pain_value>0)
                    {
                      HMI_value_setting("report0.va2.val",1);
                    }
                  break;
                  case 4://右侧屈
                    HMI_value_setting("report4.x5.val",average);//平均值
                    HMI_value_setting("report4.x6.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report4.x7.val",average*100/113);//正常值比
                    HMI_value_setting("report4.x8.val",Pain_value*10);//疼痛值
                    if(average<2000)//200
                    {
                      HMI_value_setting("report4.j0.val",average/20);
                    }
                    else
                    {
                      HMI_value_setting("report4.j0.val",100);
                    } 
                    if(Pain_value>0)
                    {
                      HMI_value_setting("report0.va2.val",1);
                    }
                  break;
                }
                // WriteBuffer_test[]="最大值1=";
                write_file(maximum_record1);
                
                // WriteBuffer_test[]="最大值2=";
                write_file(maximum_record2);
                
                // WriteBuffer_test[]="最大值3=";
                write_file(maximum_record3);
                // WriteBuffer_test[]="平均值=";
                write_file(average);

                // WriteBuffer_test[]="差异系数=";
                write_file(coefficient_variation);
                
                write_file(Pain_value);

                f_close(&file);


                Test_Step = 0;
                Force_Process_Step = 0;
                Is_start_stamp = 0;
                weight_Zero_IsInit=0;
                Pain_stamp = 0;
                HMI_value_setting("force1.ad0.val",2);//语音
                HAL_Delay(3000);

                HMI_value_setting("force1.gross.val",0);
                HMI_value_setting("force1.net.val",0);
                printf("三次测试结束\n");
              }
              else
              {
                Force_Process_Step=6;
              }
            break;
          }

