LTC0213/STM32_CERS/CERS0201/Src/main.c
        }
      }
    }
    
    //测角度模式
    if(model_channelx==2)
    {
      if(uwTick%10==0)
      {
        if(encoder_Zero_IsInit==1)//未获取零值
        {
          encoder_Zero_Data = ENCODER_read_channelx(encoder_channelx);
          encoder_Zero_IsInit = 2;
        }
        else if(encoder_Zero_IsInit==2)//零值已经记录成功
        {
          // encoder_read_before=ENCODER_read_channelx(encoder_channelx);
          // encoder_read = encoder_read_before%65535;
          encoder_read=ENCODER_read_channelx(encoder_channelx);
          data_temp = encoder_read -encoder_Zero_Data;
          temp = data_temp *3600 / ENCODER_RESOLUTION;
          Angle = temp;//角度*10
          printf("Angle=%d\n",Angle/10);
          printf("Encoder_Process_Step=%d\n",Encoder_Process_Step);

          //插补函数补充

          //超出预警阈值报警
          if(Is_thres_stamp==1)  //如果有超出预设值，那么蜂鸣器响 后期可以加语音模块
          {
            if((Angle-Record_encoder) >= Compa_encoder_value)
            {
              HMI_value_setting("encode1.ad0.val",3);
              HAL_Delay(3000);
            }        
          }

           //清零按钮判断 用于异常消除 
          if(Is_tare_stamp==1)   //如果有清零按钮按下 对应按钮 力通道选择 清零 开始测试 
          {
            Record_encoder2=Record_encoder1-Angle;
            if(Record_encoder2>10)   
            {
              Record_encoder1=0; 
              Record_encoder2=0;
              Is_tare_stamp=0;
              Encoder_Process_Step=0;
              HMI_value_setting("encode1.gross.val",0);
              HMI_value_setting("encode1.net.val",0); 
            }           
          }

          //角度检测流程
          switch (Encoder_Process_Step)
          {
            case 0:
             if(encoder_read>encoder_Zero_Data)
             {
               Encoder_Process_Step = 1;
               encoder_read = 0;
             }
             else
             {
              HMI_value_setting("encode1.gross.val",0);
              Encoder_Process_Step=0;
             }
            break;
            case 1:
              if(int_abs(encoder_read,encoder_Zero_Data)>5)
              {
                Encoder_Process_Step=2;
              }
              else 
              {
                HMI_value_setting("encode1.gross.val",0);
                Encoder_Process_Step=0;
              }
            break;
            case 2://检测初始角度
              HAL_Delay(100);
              second_count = ENCODER_read_channelx(encoder_channelx);
              if(int_abs(second_count,encoder_read)<1000) //根据测试情况更改
								
              {
                HAL_Delay(10);
                encoder_read = ENCODER_read_channelx(encoder_channelx);
                third_count = encoder_read;
                data_temp = encoder_read -encoder_Zero_Data;
                temp = data_temp *3600 / ENCODER_RESOLUTION;
                Record_encoder1=temp; //每次换皮重时赋值
                printf("Record_encoder1=%d 度\n",Record_encoder1/10); 
                Angle=temp;            
                //Is_tare_stamp=1;
                HMI_value_setting("encode1.gross.val",Angle); 
                Encoder_Process_Step=3;
              }
            break;
            case 3://开始测试 锁定预紧角度
              if(Is_start_stamp==1)   //开始测试按钮
              {
                f_res = f_mount(&fs,"0:",1);
                printf_fatfs_error(f_res);
                f_res = f_open(&file, "测试文件2.txt",FA_CREATE_ALWAYS | FA_WRITE );
                Record_encoder=Record_encoder1;
                HMI_value_setting("encode1.gross.val",Record_encoder1); 
                printf("Record_encoder1=%d 度\n",Record_encoder1); 
                Encoder_Process_Step = 4;
                HMI_value_setting("encode1.ad0.val",0);
                HAL_Delay(4000);
              }
              else
              {
                Encoder_Process_Step = 2;
              }
            break;
            case 4://角度测试 开始判断
              if (Test_Step>=3)
              {
                Encoder_Process_Step = 6;
              }
              else if(Angle>Record_encoder)   //角度大于预紧角度
              {
                if(int_abs(Angle,Record_encoder)>10) //角度大于1°
                {
                  encoder_read = 0;
                  Encoder_Process_Step =5;
                  timecount = 0;
                }
                else
                {
                  encoder_read = 0;
                }
              }
            break;
            case 5://角度测试 持续输出
              if((timecount<=90) && (int_abs(Angle,Record_encoder)>10) && (int_abs(Angle,Record_encoder))<1000)//施加大于1° 且 未超过计时
              {
                timecount++;
                //插补函数输入 
                HMI_value_setting("encode1.inx.val",1);
                in1=in0+(Angle-Record_encoder-in0)/5;
                in2=in0+2*(Angle-Record_encoder-in0)/5;
                in3=in0+3*(Angle-Record_encoder-in0)/5;
                in4=in0+4*(Angle-Record_encoder-in0)/5;
                in0=Angle-Record_encoder;
                HMI_value_setting("encode1.in1.val",in1/10);
                HMI_value_setting("encode1.in2.val",in2/10);
                HMI_value_setting("encode1.in3.val",in3/10);
                HMI_value_setting("encode1.in4.val",in4/10);
                HMI_value_setting("encode1.in0.val",in0/10);
                printf("in0=%d 度\n",in0/10); 
                write_file(in0/10);


                Encoder_Process_Step = 5;
                HMI_value_setting("encode1.net.val",in0);//0.1°
                if(in0>maximum)//0.1°
                {
                  maximum=in0;
                }
              }
              else
              {
                Test_Step++;
                timecount = 0;
                Encoder_Process_Step = 4;
                in0 = in1 = in2 = in3 = 0;
                HMI_value_setting("encode1.inx.val",0);
                HMI_value_setting("encode1.ad0.val",1);
                HMI_value_setting("encode1.chx.val",Test_Step);
                printf("测试 %d 结束\n",Test_Step);
                switch(Test_Step)
                {
                  case 1: 
                    HMI_value_setting("encode1.max1.val",maximum);
                    maximum_record1=maximum;
                    maximum =0;
                  break;
                  case 2:
                    HMI_value_setting("encode1.max2.val",maximum);
                    maximum_record2=maximum;
                    maximum =0;
                  break;
                  case 3:
                    HMI_value_setting("encode1.max3.val",maximum);
                    maximum_record3=maximum;
                    maximum =0;
                    average = (maximum_record1+maximum_record2+maximum_record3)/3;
                    printf("average=%d 度\n",in0/10); 
                    standard_deviation=sqrt((pow(maximum_record1-average,2)+pow(maximum_record2-average,2)+pow(maximum_record3-average,2))/3);
                    // printf("standard_deviation=%d N\n",standard_deviation);
                    coefficient_variation = standard_deviation*100/average;
                    printf("coefficient_variation=%d \n",coefficient_variation);
                  break;
                }
                HAL_Delay(5000);
              }
            break;
            case 6:
              if(Pain_stamp==1)
              {
                switch(encoder_modelx)
                {
                  case 1://前屈
                    HMI_value_setting("report2.x0.val",average);//平均值
                    HMI_value_setting("report2.x1.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report2.x2.val",average*100/60);//正常值比
                    HMI_value_setting("report2.x3.val",Pain_value*10);//疼痛值
                    if(average<900)//90
                    {
                      HMI_value_setting("report2.j1.val",average/9);
                    }
                    else
                    {
                      HMI_value_setting("report2.j1.val",100);
                    } 
                  break;
                  case 2://后伸
                    HMI_value_setting("report2.x5.val",average);//平均值
                    HMI_value_setting("report2.x6.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report2.x7.val",average*100/60);//正常值比
                    HMI_value_setting("report2.x8.val",Pain_value*10);//疼痛值
                    if(average<900)//90
                    {
                      HMI_value_setting("report2.j0.val",average/9);
                    }
                    else
                    {
                      HMI_value_setting("report2.j0.val",100);
                    } 
                  break;
                  case 3://左侧屈
                    HMI_value_setting("report1.x0.val",average);//平均值
                    HMI_value_setting("report1.x1.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report1.x2.val",average*100/45);//正常值比
                    HMI_value_setting("report1.x3.val",Pain_value*10);//疼痛值
                    if(average<900)//90
                    {
                      HMI_value_setting("report1.j1.val",average/9);
                    }
                    else
                    {
                      HMI_value_setting("report1.j1.val",100);
                    } 
                  break;
                  case 4://右侧屈
                    HMI_value_setting("report1.x5.val",average);//平均值
                    HMI_value_setting("report1.x6.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report1.x7.val",average*100/45);//正常值比
                    HMI_value_setting("report1.x8.val",Pain_value*10);//疼痛值
                    if(average<900)//90
                    {
                      HMI_value_setting("report1.j0.val",average/9);
                    }
                    else
                    {
                      HMI_value_setting("report1.j0.val",100);
                    } 
                  break;
                  case 5://左旋
                    HMI_value_setting("report3.x0.val",average);//平均值
                    HMI_value_setting("report3.x1.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report3.x2.val",average*100/80);//正常值比
                    HMI_value_setting("report3.x3.val",Pain_value*10);//疼痛值
                    if(average<1000)//100
                    {
                      HMI_value_setting("report3.j1.val",average/10);
                    }
                    else
                    {
                      HMI_value_setting("report3.j1.val",100);
                    } 
                  break;
                  case 6://右旋
                    HMI_value_setting("report3.x5.val",average);//平均值
                    HMI_value_setting("report3.x6.val",coefficient_variation*10);//变异系数
                    HMI_value_setting("report3.x7.val",average*100/80);//正常值比
                    HMI_value_setting("report3.x8.val",Pain_value*10);//疼痛值
                    if(average<1000)//100
                    {
                      HMI_value_setting("report3.j0.val",average/10);
                    }
                    else
                    {
                      HMI_value_setting("report3.j0.val",100);
                    }
                  break;
                }
                // WriteBuffer_test[]="最大值1=";
                write_file(maximum_record1);
                
                // WriteBuffer_test[]="最大值2=";
                write_file(maximum_record2);
                
                // WriteBuffer_test[]="最大值3=";
                write_file(maximum_record3);
                // WriteBuffer_test[]="平均值=";
                write_file(average);

                // WriteBuffer_test[]="差异系数=";
                write_file(coefficient_variation);
                
                write_file(Pain_value);
                
                f_close(&file);
                
                Test_Step = 0;
                Encoder_Process_Step = 0;
                Is_start_stamp = 0;
                encoder_Zero_IsInit=0;
                Pain_stamp =0;
                HMI_value_setting("encode1.ad0.val",2);
                HAL_Delay(3000);

                HMI_value_setting("encode1.gross.val",0);
                HMI_value_setting("encode1.net.val",0);
                printf("三次测试结束\n");
              }
              else
              {
                Encoder_Process_Step=6;
              }
            break;

