LTC0213/STM32_CERS/CERS0201/Src/main.c
      }
    }
    
  }

}

/**
  * 函数功能: 串口屏中断处理函数
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
void HMI_USARTx_IRQHANDLER(void)
{
  uint16_t tmp;
  static uint8_t HUM_Rx_count=0;  
  
  if(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_RXNE) != RESET)
  { 
    tmp=HMI_USARTx->DR;  
    if(tmp==0xF1)
    {
      HMI_RX_flag=1;
      HUM_Rx_count=1;
      HMI_Rx_buf[0]=0xF1;
      usart_rx_flag=200;
    }
    else if((HMI_RX_flag==1)&&(usart_rx_flag))
    {     
      HMI_Rx_buf[HUM_Rx_count]=tmp;
      HUM_Rx_count++;
      if(HUM_Rx_count>=HMI_RX_BUFFER_SIZE)
      {
        HUM_Rx_count=0;
        HMI_RX_flag=0;        
      }
      else if((tmp==0xFF)&&(HMI_Rx_buf[HUM_Rx_count-2]==0xFF)&&(HMI_Rx_buf[HUM_Rx_count-3]==0x00)&&(HMI_Rx_buf[HUM_Rx_count-4]==0xFF)&&(HMI_Rx_buf[HUM_Rx_count-5]==0xFF))
      {
        HMI_RX_flag=2;
        HUM_Rx_count=0;        
      }
    }
    else if(usart_rx_flag==0)
    {
      HMI_RX_flag=0;
      HUM_Rx_count=0;
    }      
  }
}

/**
  * 函数功能: 向串口屏发送数据
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
void HMI_value_setting(const char *val_str,uint32_t value)
{
  uint8_t tmp_str[30]={0};
  uint8_t i;
  
  sprintf((char *)tmp_str,"%s=%d",val_str,value);
  for(i=0;i<strlen((char *)tmp_str);++i)
  {
    HMI_USARTx->DR=tmp_str[i];
    while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
  }
  HMI_USARTx->DR=0xFF;
  while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
  HMI_USARTx->DR=0xFF;
  while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
  HMI_USARTx->DR=0xFF;
  while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
}

/**
  * 函数功能: 向串口屏发送浮点数据
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
void HMI_string_setting(const char *val_str,int32_t value)
{
  uint8_t tmp_str[50]={0};
  uint8_t i;
  float temp=(float)value;
  sprintf((char *)tmp_str,"%s=\"%.1f\"",val_str,temp/100);
  
  for(i=0;i<strlen((char *)tmp_str);++i)
  {
    HMI_USARTx->DR=tmp_str[i];
    while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
  }
  HMI_USARTx->DR=0xFF;
  while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
  HMI_USARTx->DR=0xFF;
  while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
  HMI_USARTx->DR=0xFF;
  while(__HAL_UART_GET_FLAG(&husartx_HMI, UART_FLAG_TXE) == RESET);
}

/**
  * 函数功能: 编码器读数
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
unsigned int ENCODER_read_channelx(int8_t channelx)
{
  int32_t  encoder_read_channelx=0;
  int32_t  encoder_read_motion=0;
  switch(encoder_channelx)
  {
    case 0:
      encoder_Zero_IsInit = 1;
    break;
    case 1:
      encoder_read_channelx = (XOverflowCount*XCNT_MAX) + __HAL_TIM_GET_COUNTER(&xhtimx_Encoder);
    break;
    case 2:
      encoder_read_channelx = (YOverflowCount*YCNT_MAX) + __HAL_TIM_GET_COUNTER(&yhtimx_Encoder);
    break;
  }
  if(encoder_modelx==2||encoder_modelx==3||encoder_modelx==5)
  {
    encoder_read_motion=(-1)*encoder_read_channelx;
  }
  else
  {
    encoder_read_motion=encoder_read_channelx;
  }
  return encoder_read_motion;
}

/**
  * 函数功能: 得到磁盘容量以及剩余容量
  * 输入参数: drv:磁盘编号"0:" total:总容量 单位KB  free:剩余容量 单位KB
  * 返 回 值: 返回值:0,正常.其他,错误代码
  * 说    明: 无
  */
uint8_t exf_getfree(uint8_t *drv,uint32_t *total,uint32_t *free) 
{
	FATFS *fs1;
	uint8_t res;
  uint32_t fre_clust=0, fre_sect=0, tot_sect=0;
  /* 得到磁盘信息及空闲簇数量 */
  res =(uint32_t)f_getfree((const TCHAR*)drv, (DWORD*)&fre_clust, &fs1);
  if(res==0)
	{											   
	  tot_sect=(fs1->n_fatent-2)*fs1->csize;	/* 得到总扇区数 */
	  fre_sect=fre_clust*fs1->csize;			/* 得到空闲扇区数	*/   
#if _MAX_SS!=512				  				/* 扇区大小不是512字节,则转换为512字节 */
		tot_sect*=fs1->ssize/512;
		fre_sect*=fs1->ssize/512;
#endif	  
		*total=tot_sect>>1;	/* 单位为KB */
		*free=fre_sect>>1;	/* 单位为KB */ 
 	}
	return res;
}		

/**
  * 函数功能: 递归扫描FatFs内的文件
  * 输入参数: 初始扫描路径
  * 返 回 值: res:文件系统的返回值
  * 说    明: 无
  */
static FRESULT scan_files (char* path) 
{ 
  FRESULT res; 		/* 部分在递归过程被修改的变量，不用全局变量 */	
  FILINFO fno; 
  DIR dir; 
  int i;            
  char *fn;       /* 文件名 */
	
#if _USE_LFN 
  /* 长文件名支持 */
  /* 简体中文需要2个字节保存一个“字”*/
  static char lfn[_MAX_LFN*2 + 1]; 	
  fno.lfname = lfn; 
  fno.lfsize = sizeof(lfn); 
#endif 
  /* 打开目录 */
  res = f_opendir(&dir, path); 
  if (res == FR_OK) 
	{ 
    i = strlen(path); 
    for (;;) 
		{ 
      /* 读取目录下的内容，再读会自动读下一个文件 */
      res = f_readdir(&dir, &fno); 								
      /* 为空时表示所有项目读取完毕，跳出 */
      if (res != FR_OK || fno.fname[0] == 0) break; 	
#if _USE_LFN 
      fn = *fno.lfname ? fno.lfname : fno.fname; 
#else 
      fn = fno.fname; 
#endif 
      /* 点表示当前目录，跳过 */			
      if (*fn == '.') continue; 	
      /* 目录，递归读取 */      
      if (fno.fattrib & AM_DIR)         
			{ 			
        /* 合成完整目录名 */        
        sprintf(&path[i], "/%s", fn); 		
        /* 递归遍历 */         
        res = scan_files(path);	
        path[i] = 0;         
        /* 打开失败，跳出循环 */        
        if (res != FR_OK) 
	break; 
      } 
      else 
      { 
              printf("%s/%s\r\n", path, fn);								/* 输出文件名	*/
        /* 可以在这里提取特定格式的文件路径 */        
      }//else
    } //for
  } 
  return res; 
}

/**
  * 函数功能: 文件系统读写测试
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
static void read_write_flie(void)
{	

/*----------------------- 文件系统测试：写测试 -----------------------------*/
  /* 打开文件，如果文件不存在则创建它 */
  printf("\r\n****** 即将进行文件写入测试... ******\r\n");	
  f_res = f_open(&file, "FatFs读写测试文件.txt",FA_CREATE_ALWAYS | FA_WRITE );
  printf_fatfs_error(f_res);
  if ( f_res == FR_OK )
  {
    printf("》打开/创建FatFs读写测试文件.txt文件成功，向文件写入数据。\r\n");
    /* 将指定存储区内容写入到文件内 */
		f_res=f_write(&file,WriteBuffer,sizeof(WriteBuffer),&fnum);
    if(f_res==FR_OK)
    {
      // printf("》文件写入成功，写入字节数据：%d\n",fnum);
      // printf("》向文件写入的数据为：\r\n%s\r\n",WriteBuffer);
    }
    else
    {
      printf("！！文件写入失败：(%d)\n",f_res);
    }    
		/* 不再读写，关闭文件 */
    f_close(&file);
  }
  else
  {	
          printf("！！打开/创建文件失败。\r\n");
  }
	
/*------------------- 文件系统测试：读测试 ------------------------------------*/
  printf("****** 即将进行文件读取测试... ******\r\n");
  f_res = f_open(&file, "FatFs读写测试文件.txt", FA_OPEN_EXISTING | FA_READ); 	 
  if(f_res == FR_OK)
  {
    printf("》打开文件成功。\r\n");
    f_res = f_read(&file, ReadBuffer, sizeof(ReadBuffer), &fnum); 
    if(f_res==FR_OK)
    {
      printf("》文件读取成功,读到字节数据：%d\r\n",fnum);
      printf("》读取得的文件数据为：\r\n%s \r\n", ReadBuffer);	
    }
    else
    {
      printf("！！文件读取失败：(%d)\n",f_res);
    }		
  }
  else
  {
          printf("！！打开文件失败。\r\n");
  }
  /* 不再读写，关闭文件 */
  f_close(&file);	
}

/**
  * 函数功能: 文件系统写文件
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
unsigned int write_file(int32_t date)
{
  sprintf(WriteBuffer_test, "%d", date);
  f_write(&file,WriteBuffer_test,sizeof(WriteBuffer_test),&fnum);
  f_sync(&file);
  sprintf(WriteBuffer_test, "%d", 0x0000);
  
